Revit 2026 API

# TableSectionDataGetColumnWidthInPixels Method

---

This returns a column's width in logical pixels

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetColumnWidthInPixels(
	int nCol
)
```
```vb
Public Function GetColumnWidthInPixels (
	nCol As Integer
) As Integer
```
```cpp
public:
int GetColumnWidthInPixels(
	int nCol
)
```
```fsharp
member GetColumnWidthInPixels :
        nCol : int -> int
```

#### Parameters

nCol Int32

#### Return Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | The given column number nCol is invalid. |

#### Reference

TableSectionData Class

Autodesk.Revit.DB Namespace